# Модуль json предоставляет разнообразные инструменты для анализа и обработки данных JSON. 
# Некоторые из этих инструментов позволяют переформатировать файл, чтобы вам было удобнее взаимодействовать 
# с необработанными данными, прежде чем вы начнете работать с ними на программном уровне.

# Для начала скачаем данные и выведем их в формате, лучше подходящем для чтения. Файл очень длинный, поэтому вместо того, 
# чтобы выводить его, данные будут записаны в новый файл. После этого вы сможете открыть его и прокрутить к нужной позиции:

from pathlib import Path
import json

# Считывает данные в строковом формате и преобразует в объект Python.
path = Path('создание карт с глобальными наборами данных формат geojson/eq_data/eq_data_1_day_m1.geojson')
contents = path.read_text()
# Считываем данные из файла в строковом формате и вызываем функцию json.loads() для преобразования строкового представления файла в объект Python:
all_eq_data = json.loads(contents)
# Весь набор данных преобразуется в один словарь, который мы присваиваем переменной all_eq_data.

# Создает удобную для чтения версию файла данных.
path = Path('создание карт с глобальными наборами данных формат geojson/eq_data/readable_eq_data.geojson')   # затем мы определяем новую переменную path, в которой можем сохранить полученные данные в формате.
# Функция json.dumps() поддерживает необязательный аргумент indent, позволяющий указать размер отступа вложенных элементов в структуре данных.
readable_contents = json.dumps(all_eq_data, indent=4)
path.write_text(readable_contents)